## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/240682)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:902" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ cpu                      = "2048" -> "4096" # forces replacement
      ~ id                       = "ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ memory                   = "4096" -> "8192" # forces replacement
      ~ revision                 = 902 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-parsergraphqlwrapper"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ParserGraphQLWrapper"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:902" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"7e9172a1-a825-4c65-a6b1-c84024611c1a","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":660,"Program":"tfcmt","SHA1":"274bcd6e4be455b3e9ad70d155bdd45e1d0419fc","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->